unittests/output/E_0401.dot
digraph D {
    labelloc="t";
    label=<<B><FONT POINT-SIZE="18">6.2 AD: Lieferende LF an NB</FONT></B><BR/><BR/><B><FONT POINT-SIZE="16">6.2.1 E_0401_Abmeldung prüfen</FONT></B><BR/><BR/><BR/><BR/>>;
    "Start" [margin="0.2,0.12", shape=box, style=filled, fillcolor="#7a8da1", label=<<B>E_0401</B><BR align="center"/><FONT point-size="12"><B><U>Prüfende Rolle:</U> NB</B></FONT><BR align="center"/>>];
    "1" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>1: </B>Liegt ein Transaktionsgrund vor, der eine Abmeldung nur in<BR align="left"/>die Zukunft zulässt?<BR align="left"/>Das ist bei den folgenden Transaktionsgründen der Fall:<BR align="left"/> Wechsel<BR align="left"/> Ende der ESV ohne Folgelieferung<BR align="left"/> Aufhebung einer zukünftigen Zuordnung wegen<BR align="left"/>aufgehobenem Vertragsverhältnis<BR align="left"/>>];
    "2" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>2: </B>Liegt ein Transaktionsgrund vor, welcher mitteilt, dass der<BR align="left"/>Kunde vor Lieferbeginn ausgezogen ist, bzw. die<BR align="left"/>Marktlokation vor Lieferbeginn stillgelegt wurde?<BR align="left"/>Das ist bei den folgenden Transaktionsgründen der Fall:<BR align="left"/> Aufhebung einer zukünftigen Zuordnung wegen Auszug<BR align="left"/>des Kunden<BR align="left"/> Aufhebung einer zukünftigen Zuordnung wegen<BR align="left"/>Stilllegung<BR align="left"/>>];
    "3" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>3: </B>Liegt das Abmeldedatum mindestens einen Tag nach dem<BR align="left"/>Eingangsdatum der Abmeldung?<BR align="left"/>>];
    "A01" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cca9ab", label=<<B>A01</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Fristüberschreitung bei Aufhebung einer zu-<BR align="left"/>künftigen Zuordnung wegen Auszug oder Still-<BR align="left"/>legung.<BR align="left"/></FONT>>];
    "4" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>4: </B>Liegt das Eingangsdatum mindestens 6 WT vor dem<BR align="left"/>Abmeldedatum?<BR align="left"/>>];
    "A02" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cca9ab", label=<<B>A02</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Fristüberschreitung bei Transaktionsgründen für<BR align="left"/>eine Abmeldung in der Zukunft.<BR align="left"/></FONT>>];
    "5" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>5: </B>Liegt der Transaktionsgrund<BR align="left"/>• Aufhebung einer zukünftigen Zuordnung wegen auf-<BR align="left"/>gehobenem Vertragsverhältnis<BR align="left"/>vor?<BR align="left"/>>];
    "6" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>6: </B>Handelt es sich um eine Marktlokation, deren Mess-<BR align="left"/>lokationen vollständig mit iMS ausgestattet sind oder/und<BR align="left"/>deren Prognosegrundlage auf Basis von Werten erfolgt?<BR align="left"/>>];
    "7" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>7: </B>Liegt das Abmeldedatum mindestens einen Tag nach dem<BR align="left"/>Eingangsdatum der Abmeldung?<BR align="left"/>>];
    "A03" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cca9ab", label=<<B>A03</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Eingangsfrist bei iMS/kME mit RLM nicht ein-<BR align="left"/>gehalten.<BR align="left"/></FONT>>];
    "8" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>8: </B>Liegt das Eingangsdatum der Abmeldung mehr als sechs<BR align="left"/>Wochen nach dem Abmeldedatum der Abmeldung?<BR align="left"/>>];
    "A04" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cca9ab", label=<<B>A04</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Fristüberschreitung bei kME ohne RLM/mME/<BR align="left"/>Pauschalanlage.<BR align="left"/></FONT>>];
    "9" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>9: </B>Erfolgt die Aufhebung einer zukünftigen Zuordnung zu dem<BR align="left"/>gleichen Datum (Zeitpunkt), welcher dem Lieferanten im<BR align="left"/>Lieferbeginn bestätigt wurde?<BR align="left"/>>];
    "A05" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cca9ab", label=<<B>A05</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Die Aufhebung einer zukünftigen Zuordnung<BR align="left"/>muss zum Datum (Zeitpunkt) angegeben werden,<BR align="left"/>wie im Lieferbeginn bestätigt.<BR align="left"/></FONT>>];
    "10" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>10: </B>Wurde die Zuordnung des anfragenden Lieferanten zur<BR align="left"/>Marktlokation zum identischen Abmeldedatum bereits durch<BR align="left"/>eine Bestätigung in den folgenden Prozessschritten beendet?<BR align="left"/>Fall:<BR align="left"/> SD: Lieferende von LF an NB, Prozessschritt 2 "Antwort<BR align="left"/>auf Abmeldung"<BR align="left"/> SD: Lieferende von NB an LF, Prozessschritt 2 "Antwort<BR align="left"/>auf Abmeldung"<BR align="left"/> SD: Lieferbeginn, Prozessschritt 4 "Beantwortung der<BR align="left"/>Abmeldeanfrage" oder die Bestätigung erfolgt durch<BR align="left"/>die Fristverstreichung<BR align="left"/>>];
    "A06" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cca9ab", label=<<B>A06</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Zustimmung<BR align="left"/>Bestätigung der Abmeldung<BR align="left"/></FONT>>];
    "11" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>11: </B>Ist der anfragende LF am Folgetag des Abmeldungsdatum der<BR align="left"/>Marktlokation noch zugeordnet?<BR align="left"/>>];
    "12" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>12: </B>Liegt ein Transaktionsgrund vor, aus welchem hervorgeht,<BR align="left"/>dass der Anschlussnutzer ausgezogen ist?<BR align="left"/>Das ist bei den folgenden Transaktionsgründen der Fall:<BR align="left"/> Ein-/Auszug (Umzug)<BR align="left"/> Auszug wegen Stilllegung<BR align="left"/>>];
    "A07" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cca9ab", label=<<B>A07</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Lieferende zum Abmeldedatum wurde bereits<BR align="left"/>bestätigt<BR align="left"/></FONT>>];
    "13" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>13: </B>Liegt in der bereits bestätigten Abmeldung ein<BR align="left"/>Transaktionsgrund vor, aus welchem nicht hervorgeht, dass<BR align="left"/>der Anschlussnutzer ausgezogen ist?<BR align="left"/>Das ist bei den folgenden Transaktionsgründen der Fall:<BR align="left"/> Ein-/Auszug (Umzug)<BR align="left"/> Auszug wegen Stilllegung<BR align="left"/> Aufhebung einer zukünftigen Zuordnung wegen<BR align="left"/>Stilllegung<BR align="left"/>>];
    "A08" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cca9ab", label=<<B>A08</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Lieferende zum Abmeldedatum wurde aus<BR align="left"/>gleichem Grund bereits bestätigt.<BR align="left"/></FONT>>];
    "A09" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cca9ab", label=<<B>A09</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Zustimmung<BR align="left"/>Erneute Bestätigung der Abmeldung aufgrund der<BR align="left"/>Information, dass der Anschlussnutzer nicht mehr<BR align="left"/>an der Marktlokation vorhanden ist.<BR align="left"/>Hinweis: Das bisher bestätigte Bilanzierungsende<BR align="left"/>bleibt unverändert bestehen.<BR align="left"/></FONT>>];

    "Start" -> "1";
    "1" -> "4" [label="Ja"];
    "1" -> "2" [label="Nein"];
    "2" -> "3" [label="Ja"];
    "2" -> "6" [label="Nein"];
    "3" -> "A01" [label="Nein"];
    "3" -> "9" [label="Ja"];
    "4" -> "A02" [label="Nein"];
    "4" -> "5" [label="Ja"];
    "5" -> "9" [label="Ja"];
    "5" -> "10" [label="Nein"];
    "6" -> "7" [label="Ja"];
    "6" -> "8" [label="Nein"];
    "7" -> "A03" [label="Nein"];
    "7" -> "10" [label="Ja"];
    "8" -> "A04" [label="Nein"];
    "8" -> "10" [label="Ja"];
    "9" -> "A05" [label="Nein"];
    "9" -> "10" [label="Ja"];
    "10" -> "11" [label="Ja"];
    "10" -> "A06" [label="Nein"];
    "11" -> "12" [label="Nein"];
    "11" -> "A06" [label="Ja"];
    "12" -> "A07" [label="Nein"];
    "12" -> "13" [label="Ja"];
    "13" -> "A08" [label="Nein"];
    "13" -> "A09" [label="Ja"];
}
