unittests/output/E_0401.puml
@startuml
skinparam Shadowing false
skinparam NoteBorderColor #f3f1f6
skinparam NoteBackgroundColor #f3f1f6
skinparam NoteFontSize 12
skinparam ActivityBorderColor none
skinparam ActivityBackgroundColor #7a8da1
skinparam ActivityFontSize 16
skinparam ArrowColor #7aab8a
skinparam ArrowFontSize 16
skinparam ActivityDiamondBackgroundColor #7aab8a
skinparam ActivityDiamondBorderColor #7aab8a
skinparam ActivityDiamondFontSize 18
skinparam defaultFontName DejaVu Serif Condensed
skinparam ActivityEndColor #669580

header
<b>FV2210
2022-12-12
endheader

title
6.2 AD: Lieferende LF an NB

6.2.1 E_0401_Abmeldung prüfen



end title
:<b>E_0401</b>;
note right
<b><i>Prüfende Rolle: NB
end note

if (<b>1: </b> Liegt ein Transaktionsgrund vor, der eine Abmeldung nur in
die Zukunft zulässt?
Das ist bei den folgenden Transaktionsgründen der Fall:
 Wechsel
 Ende der ESV ohne Folgelieferung
 Aufhebung einer zukünftigen Zuordnung wegen
aufgehobenem Vertragsverhältnis) then (ja)
    if (<b>4: </b> Liegt das Eingangsdatum mindestens 6 WT vor dem
Abmeldedatum?) then (ja)
    else (nein)
        :A02;
        note left
            Cluster: Ablehnung
            Fristüberschreitung bei Transaktionsgründen für
            eine Abmeldung in der Zukunft.
        endnote
        kill;
    endif
    if (<b>5: </b> Liegt der Transaktionsgrund
• Aufhebung einer zukünftigen Zuordnung wegen auf-
gehobenem Vertragsverhältnis
vor?) then (ja)
        if (<b>9: </b> Erfolgt die Aufhebung einer zukünftigen Zuordnung zu dem
gleichen Datum (Zeitpunkt&#41;, welcher dem Lieferanten im
Lieferbeginn bestätigt wurde?) then (ja)
        else (nein)
            :A05;
            note left
                Cluster: Ablehnung
                Die Aufhebung einer zukünftigen Zuordnung
                muss zum Datum (Zeitpunkt&#41; angegeben werden,
                wie im Lieferbeginn bestätigt.
            endnote
            kill;
        endif
        if (<b>10: </b> Wurde die Zuordnung des anfragenden Lieferanten zur
Marktlokation zum identischen Abmeldedatum bereits durch
eine Bestätigung in den folgenden Prozessschritten beendet?
Fall:
 SD: Lieferende von LF an NB, Prozessschritt 2 "Antwort
auf Abmeldung"
 SD: Lieferende von NB an LF, Prozessschritt 2 "Antwort
auf Abmeldung"
 SD: Lieferbeginn, Prozessschritt 4 "Beantwortung der
Abmeldeanfrage" oder die Bestätigung erfolgt durch
die Fristverstreichung) then (ja)
            if (<b>11: </b> Ist der anfragende LF am Folgetag des Abmeldungsdatum der
Marktlokation noch zugeordnet?) then (ja)
            else (nein)
                if (<b>12: </b> Liegt ein Transaktionsgrund vor, aus welchem hervorgeht,
dass der Anschlussnutzer ausgezogen ist?
Das ist bei den folgenden Transaktionsgründen der Fall:
 Ein-/Auszug (Umzug&#41;
 Auszug wegen Stilllegung) then (ja)
                else (nein)
                    :A07;
                    note left
                        Cluster: Ablehnung
                        Lieferende zum Abmeldedatum wurde bereits
                        bestätigt
                    endnote
                    kill;
                endif
                if (<b>13: </b> Liegt in der bereits bestätigten Abmeldung ein
Transaktionsgrund vor, aus welchem nicht hervorgeht, dass
der Anschlussnutzer ausgezogen ist?
Das ist bei den folgenden Transaktionsgründen der Fall:
 Ein-/Auszug (Umzug&#41;
 Auszug wegen Stilllegung
 Aufhebung einer zukünftigen Zuordnung wegen
Stilllegung) then (ja)
                    :A09;
                    note left
                        Cluster: Zustimmung
                        Erneute Bestätigung der Abmeldung aufgrund der
                        Information, dass der Anschlussnutzer nicht mehr
                        an der Marktlokation vorhanden ist.
                        Hinweis: Das bisher bestätigte Bilanzierungsende
                        bleibt unverändert bestehen.
                    endnote
                    kill;
                else (nein)
                    :A08;
                    note left
                        Cluster: Ablehnung
                        Lieferende zum Abmeldedatum wurde aus
                        gleichem Grund bereits bestätigt.
                    endnote
                    kill;
                endif
            endif
        else (nein)
        endif
        :A06;
        note left
            Cluster: Zustimmung
                                Bestätigung der Abmeldung
        endnote
        kill;
    else (nein)
    endif
else (nein)
    if (<b>2: </b> Liegt ein Transaktionsgrund vor, welcher mitteilt, dass der
Kunde vor Lieferbeginn ausgezogen ist, bzw. die
Marktlokation vor Lieferbeginn stillgelegt wurde?
Das ist bei den folgenden Transaktionsgründen der Fall:
 Aufhebung einer zukünftigen Zuordnung wegen Auszug
des Kunden
 Aufhebung einer zukünftigen Zuordnung wegen
Stilllegung) then (ja)
        if (<b>3: </b> Liegt das Abmeldedatum mindestens einen Tag nach dem
Eingangsdatum der Abmeldung?) then (ja)
        else (nein)
            :A01;
            note left
                Cluster: Ablehnung
                Fristüberschreitung bei Aufhebung einer zu-
                künftigen Zuordnung wegen Auszug oder Still-
                legung.
            endnote
            kill;
        endif
        if (<b>9: </b> Erfolgt die Aufhebung einer zukünftigen Zuordnung zu dem
gleichen Datum (Zeitpunkt&#41;, welcher dem Lieferanten im
Lieferbeginn bestätigt wurde?) then (ja)
        else (nein)
            :A05;
            note left
                Cluster: Ablehnung
                Die Aufhebung einer zukünftigen Zuordnung
                muss zum Datum (Zeitpunkt&#41; angegeben werden,
                wie im Lieferbeginn bestätigt.
            endnote
            kill;
        endif
        if (<b>10: </b> Wurde die Zuordnung des anfragenden Lieferanten zur
Marktlokation zum identischen Abmeldedatum bereits durch
eine Bestätigung in den folgenden Prozessschritten beendet?
Fall:
 SD: Lieferende von LF an NB, Prozessschritt 2 "Antwort
auf Abmeldung"
 SD: Lieferende von NB an LF, Prozessschritt 2 "Antwort
auf Abmeldung"
 SD: Lieferbeginn, Prozessschritt 4 "Beantwortung der
Abmeldeanfrage" oder die Bestätigung erfolgt durch
die Fristverstreichung) then (ja)
            if (<b>11: </b> Ist der anfragende LF am Folgetag des Abmeldungsdatum der
Marktlokation noch zugeordnet?) then (ja)
            else (nein)
                if (<b>12: </b> Liegt ein Transaktionsgrund vor, aus welchem hervorgeht,
dass der Anschlussnutzer ausgezogen ist?
Das ist bei den folgenden Transaktionsgründen der Fall:
 Ein-/Auszug (Umzug&#41;
 Auszug wegen Stilllegung) then (ja)
                else (nein)
                    :A07;
                    note left
                        Cluster: Ablehnung
                        Lieferende zum Abmeldedatum wurde bereits
                        bestätigt
                    endnote
                    kill;
                endif
                if (<b>13: </b> Liegt in der bereits bestätigten Abmeldung ein
Transaktionsgrund vor, aus welchem nicht hervorgeht, dass
der Anschlussnutzer ausgezogen ist?
Das ist bei den folgenden Transaktionsgründen der Fall:
 Ein-/Auszug (Umzug&#41;
 Auszug wegen Stilllegung
 Aufhebung einer zukünftigen Zuordnung wegen
Stilllegung) then (ja)
                    :A09;
                    note left
                        Cluster: Zustimmung
                        Erneute Bestätigung der Abmeldung aufgrund der
                        Information, dass der Anschlussnutzer nicht mehr
                        an der Marktlokation vorhanden ist.
                        Hinweis: Das bisher bestätigte Bilanzierungsende
                        bleibt unverändert bestehen.
                    endnote
                    kill;
                else (nein)
                    :A08;
                    note left
                        Cluster: Ablehnung
                        Lieferende zum Abmeldedatum wurde aus
                        gleichem Grund bereits bestätigt.
                    endnote
                    kill;
                endif
            endif
        else (nein)
        endif
        :A06;
        note left
            Cluster: Zustimmung
                                Bestätigung der Abmeldung
        endnote
        kill;
    else (nein)
        if (<b>6: </b> Handelt es sich um eine Marktlokation, deren Mess-
lokationen vollständig mit iMS ausgestattet sind oder/und
deren Prognosegrundlage auf Basis von Werten erfolgt?) then (ja)
            if (<b>7: </b> Liegt das Abmeldedatum mindestens einen Tag nach dem
Eingangsdatum der Abmeldung?) then (ja)
            else (nein)
                :A03;
                note left
                    Cluster: Ablehnung
                    Eingangsfrist bei iMS/kME mit RLM nicht ein-
                    gehalten.
                endnote
                kill;
            endif
            if (<b>10: </b> Wurde die Zuordnung des anfragenden Lieferanten zur
Marktlokation zum identischen Abmeldedatum bereits durch
eine Bestätigung in den folgenden Prozessschritten beendet?
Fall:
 SD: Lieferende von LF an NB, Prozessschritt 2 "Antwort
auf Abmeldung"
 SD: Lieferende von NB an LF, Prozessschritt 2 "Antwort
auf Abmeldung"
 SD: Lieferbeginn, Prozessschritt 4 "Beantwortung der
Abmeldeanfrage" oder die Bestätigung erfolgt durch
die Fristverstreichung) then (ja)
                if (<b>11: </b> Ist der anfragende LF am Folgetag des Abmeldungsdatum der
Marktlokation noch zugeordnet?) then (ja)
                else (nein)
                    if (<b>12: </b> Liegt ein Transaktionsgrund vor, aus welchem hervorgeht,
dass der Anschlussnutzer ausgezogen ist?
Das ist bei den folgenden Transaktionsgründen der Fall:
 Ein-/Auszug (Umzug&#41;
 Auszug wegen Stilllegung) then (ja)
                    else (nein)
                        :A07;
                        note left
                            Cluster: Ablehnung
                            Lieferende zum Abmeldedatum wurde bereits
                            bestätigt
                        endnote
                        kill;
                    endif
                    if (<b>13: </b> Liegt in der bereits bestätigten Abmeldung ein
Transaktionsgrund vor, aus welchem nicht hervorgeht, dass
der Anschlussnutzer ausgezogen ist?
Das ist bei den folgenden Transaktionsgründen der Fall:
 Ein-/Auszug (Umzug&#41;
 Auszug wegen Stilllegung
 Aufhebung einer zukünftigen Zuordnung wegen
Stilllegung) then (ja)
                        :A09;
                        note left
                            Cluster: Zustimmung
                            Erneute Bestätigung der Abmeldung aufgrund der
                            Information, dass der Anschlussnutzer nicht mehr
                            an der Marktlokation vorhanden ist.
                            Hinweis: Das bisher bestätigte Bilanzierungsende
                            bleibt unverändert bestehen.
                        endnote
                        kill;
                    else (nein)
                        :A08;
                        note left
                            Cluster: Ablehnung
                            Lieferende zum Abmeldedatum wurde aus
                            gleichem Grund bereits bestätigt.
                        endnote
                        kill;
                    endif
                endif
            else (nein)
            endif
            :A06;
            note left
                Cluster: Zustimmung
                                    Bestätigung der Abmeldung
            endnote
            kill;
        else (nein)
            if (<b>8: </b> Liegt das Eingangsdatum der Abmeldung mehr als sechs
Wochen nach dem Abmeldedatum der Abmeldung?) then (ja)
            else (nein)
                :A04;
                note left
                    Cluster: Ablehnung
                    Fristüberschreitung bei kME ohne RLM/mME/
                    Pauschalanlage.
                endnote
                kill;
            endif
            if (<b>10: </b> Wurde die Zuordnung des anfragenden Lieferanten zur
Marktlokation zum identischen Abmeldedatum bereits durch
eine Bestätigung in den folgenden Prozessschritten beendet?
Fall:
 SD: Lieferende von LF an NB, Prozessschritt 2 "Antwort
auf Abmeldung"
 SD: Lieferende von NB an LF, Prozessschritt 2 "Antwort
auf Abmeldung"
 SD: Lieferbeginn, Prozessschritt 4 "Beantwortung der
Abmeldeanfrage" oder die Bestätigung erfolgt durch
die Fristverstreichung) then (ja)
                if (<b>11: </b> Ist der anfragende LF am Folgetag des Abmeldungsdatum der
Marktlokation noch zugeordnet?) then (ja)
                else (nein)
                    if (<b>12: </b> Liegt ein Transaktionsgrund vor, aus welchem hervorgeht,
dass der Anschlussnutzer ausgezogen ist?
Das ist bei den folgenden Transaktionsgründen der Fall:
 Ein-/Auszug (Umzug&#41;
 Auszug wegen Stilllegung) then (ja)
                    else (nein)
                        :A07;
                        note left
                            Cluster: Ablehnung
                            Lieferende zum Abmeldedatum wurde bereits
                            bestätigt
                        endnote
                        kill;
                    endif
                    if (<b>13: </b> Liegt in der bereits bestätigten Abmeldung ein
Transaktionsgrund vor, aus welchem nicht hervorgeht, dass
der Anschlussnutzer ausgezogen ist?
Das ist bei den folgenden Transaktionsgründen der Fall:
 Ein-/Auszug (Umzug&#41;
 Auszug wegen Stilllegung
 Aufhebung einer zukünftigen Zuordnung wegen
Stilllegung) then (ja)
                        :A09;
                        note left
                            Cluster: Zustimmung
                            Erneute Bestätigung der Abmeldung aufgrund der
                            Information, dass der Anschlussnutzer nicht mehr
                            an der Marktlokation vorhanden ist.
                            Hinweis: Das bisher bestätigte Bilanzierungsende
                            bleibt unverändert bestehen.
                        endnote
                        kill;
                    else (nein)
                        :A08;
                        note left
                            Cluster: Ablehnung
                            Lieferende zum Abmeldedatum wurde aus
                            gleichem Grund bereits bestätigt.
                        endnote
                        kill;
                    endif
                endif
            else (nein)
            endif
            :A06;
            note left
                Cluster: Zustimmung
                                    Bestätigung der Abmeldung
            endnote
            kill;
        endif
    endif
endif
if (<b>10: </b> Wurde die Zuordnung des anfragenden Lieferanten zur
Marktlokation zum identischen Abmeldedatum bereits durch
eine Bestätigung in den folgenden Prozessschritten beendet?
Fall:
 SD: Lieferende von LF an NB, Prozessschritt 2 "Antwort
auf Abmeldung"
 SD: Lieferende von NB an LF, Prozessschritt 2 "Antwort
auf Abmeldung"
 SD: Lieferbeginn, Prozessschritt 4 "Beantwortung der
Abmeldeanfrage" oder die Bestätigung erfolgt durch
die Fristverstreichung) then (ja)
    if (<b>11: </b> Ist der anfragende LF am Folgetag des Abmeldungsdatum der
Marktlokation noch zugeordnet?) then (ja)
    else (nein)
        if (<b>12: </b> Liegt ein Transaktionsgrund vor, aus welchem hervorgeht,
dass der Anschlussnutzer ausgezogen ist?
Das ist bei den folgenden Transaktionsgründen der Fall:
 Ein-/Auszug (Umzug&#41;
 Auszug wegen Stilllegung) then (ja)
        else (nein)
            :A07;
            note left
                Cluster: Ablehnung
                Lieferende zum Abmeldedatum wurde bereits
                bestätigt
            endnote
            kill;
        endif
        if (<b>13: </b> Liegt in der bereits bestätigten Abmeldung ein
Transaktionsgrund vor, aus welchem nicht hervorgeht, dass
der Anschlussnutzer ausgezogen ist?
Das ist bei den folgenden Transaktionsgründen der Fall:
 Ein-/Auszug (Umzug&#41;
 Auszug wegen Stilllegung
 Aufhebung einer zukünftigen Zuordnung wegen
Stilllegung) then (ja)
            :A09;
            note left
                Cluster: Zustimmung
                Erneute Bestätigung der Abmeldung aufgrund der
                Information, dass der Anschlussnutzer nicht mehr
                an der Marktlokation vorhanden ist.
                Hinweis: Das bisher bestätigte Bilanzierungsende
                bleibt unverändert bestehen.
            endnote
            kill;
        else (nein)
            :A08;
            note left
                Cluster: Ablehnung
                Lieferende zum Abmeldedatum wurde aus
                gleichem Grund bereits bestätigt.
            endnote
            kill;
        endif
    endif
else (nein)
endif
:A06;
note left
    Cluster: Zustimmung
                        Bestätigung der Abmeldung
endnote
kill;

@enduml
